{"pages":[],"posts":[{"title":"Diary 2020.5.27","text":"学习：完成离散数学和工图大作业，工图大作业学到了很多，离散数学老师讲课也讲的很好。工图主要就是扫描切除、画螺旋线、引导线画基底等基本作图。老实说，做了很久，嘛，好歹还是学到了些东西，虽然简单。然后晚上做了托福口语，看了会儿数分就睡了。健身：侧腹训练。生活：看完了实力至上主义教室，老实说，精致的利己主义在某些情况下确实挺实用的，这种唯胜利至上，把一切都当做工具的做法，并不讨厌。但确实没有情感的人生就太糟糕了。阅读：并没有，淦，为什么忘了读书。我想先读资治通鉴，都是些故事的内容，但就是太多了。","link":"/2020/05/28/Diary-2020-5-27/"},{"title":"Plan-2020-6-15","text":"学习：完成电设实验，预计花费：6h（上午9:00-11:00）下午（2:00-5:00）晚上（8：00-9：00） 10完成数分一次测试并翻书复习 5阅读：《predictably irrational》合计2h及以上 5 健身：跑步 2km 5桥 静态 3 动态40次 5 作息：8:00前起，12：00前睡 5 饮食：少吃碳水（1碗饭），多摄入蛋白质 3 及格得分：30当前分数：21 总结：今天确实是个bad day。尽管羞耻，但这也是日记必须记录的一部分。今天只完成了跑步、饮食方面的任务，学习的任务一项也没达成，我觉得主要的原因就是拖延症，以及沉溺于娱乐的一种惯性。妈的，都要考试了还这么浪，忏悔！今天分数：跑步+5 饮食+3 作息+5 得分 13 不及格引以为鉴！当前分数：34","link":"/2020/06/14/Plan-2020-6-15/"},{"title":"Plan-2020-6-14","text":"健身：斜腹肌+慢跑 早上锻炼！学习：1.完成思修3000字论文，限时4h，上午2h时间（10:00-12:00），下午2h时间（3:00-5:00）提前完成可做其他任务2.数分学习，首先再熟悉一下最后一节的内容1h（5:00-6:00）然后做期末套卷并翻书来熟练相应位置的内容与题型2h不限量任务（8:00-10:00）3.程设学习，熟练后面要考的ppt并查阅相关资料，记好笔记，不限量任务1h（10:00-11:00）饮食：中午晚上不超过一碗，素：荤=7:3作息：尽量8:00起，12:00前睡 得分：健身 7points学习 思修 5points 数分 10points 程设 5points饮食 4points作息 5points 合格标准：总计20points 目前分数：0这种计算得分的方式是知乎上发现的，到时候再好好看看做篇笔记！今日总结：思修完成+5健身完成+7作息+4饮食+5数分和编程因为低估了思修完成时间没怎么做，今天玩的时间还是有点多了。明天注意 目前分数：21","link":"/2020/06/14/Plan-2020-6-14/"},{"title":"Diary-2020-6-1","text":"“小时候跑得快的受欢迎青年时打架厉害的受欢迎长大后就是头脑好用的受欢迎了所以，经常健身、练习格斗、多读书学习。–Animation 《Grey fruits》”","link":"/2020/06/01/Diary-2020-6-1/"},{"title":"Plan-2020-6-16","text":"学习：上午完成所有电设实验内容，必须学满4个周期学时，如若未完成，下午1:00开始补 10数分测试2套 10 健身：窄距深蹲2x20 5桥 静态 5 动态 5 作息：7:30起，12:00睡 饮食：主食一碗饭，多摄入素菜 4 今天吸取铁的教训！早上起来第一件事不是他妈的刷剧，给老子学习！学完了一个周期再用来休息，要控制时间！","link":"/2020/06/15/Plan-2020-6-16/"},{"title":"Diary-2020-6-8","text":"期末了，抓紧复习！！！！我不能松懈了！关于信息过载的问题：1.信息过载是古往今来一直存在的问题，但是对领域足够熟悉的人不会有这种感觉，产生这种感觉的唯一原因就是对其领域不熟悉。（即越意外的事越多，实际上人对信息把控能力就会越低，就会感觉好像信息过载了）。2.对其领域足够熟悉的人不会觉得信息过载，相反，由于信息量庞大，真正的精华是很少的，他们寻找信息有如海底捞针一般，所以如何筛选出好的信息，是对抗巨量信息的一个好办法。留作问题待解决3.商业上，不断提高客户对产品体验的阈值，就会使客户产生依赖，进而变得离不开。有如现代人看老电影会觉得老电影很难看一样（大部分），是因为人们对电影的要求提高了。同样，产品的体验也会产生同样的作用。一家高级餐厅为什么要把后厨打扫的一尘不染，不是为了给客户看，也不是为了提高食品卫生水平，而是为了留住好的大厨。","link":"/2020/06/08/Diary-2020-6-8/"},{"title":"a question about automation","text":"自动化的当下，被时代所需求的人才究竟是能够熟练运用各种工具的人（换一句话说，就是依赖自动化与各种工具的人）还是技能内化的人呢？（自身熟练掌握各种技能）目前的思考：我想，这可能需要和未来的职业有关，律师、会计、医生等暂时大部分技能不需要自动化的人，主要和个人有关，（实际上我感觉医生已经快和自动化大部分接轨了）但是工程师、大部分管理人员就是对工具依赖性很强。又或者两者兼得才是未来需要的人才？","link":"/2020/05/28/a-question-about-automation/"},{"title":"Principles 10 Rules","text":"之前读过《原则》这本书，我认为作者这种方式很有趣，目前书还没读完，书放在学校了，但是现在打算根据所讲效仿一下。虽然有点中二。。。但是考虑到最近几天临近期末了复习效率实在不是很高，所以打算借此机会约束下自己。 向盟约起誓！アッシェント! 第一条Rule1在生效时间内禁止一切摸鱼和走神。（关闭手机消息提醒，这段时间只专注于任务） 第二条Rule2所有的问题靠自己的学习和积累的才智解决。 第三条Rule3学习途中必须获得与所付出时间所对等的收获。（不能死磕一个问题，也不能浅尝辄止） 第四条Rule4只要不违反第三条，学习内容不受限制。 第五条Rule5受限制时间内（如上课期间和特别指定任务时间内），有权利决定所学内容。 第六条Rule6所指定的计划除不可抗力（需注明原因），否则绝对遵守。向盟约起誓！ 第七条Rule7出现问题如若未果则应记下来并咨询或查询。 第八条Rule8学习中如果有不正当操作，只要出现就视作失败。 第九条Rule9以神的名义宣布，以上八条，全部都是一般情况下不可变更的规则（变更需要注明） 第十条Rule10大家一起快乐地学习吧！ 那么，游戏开始吧！では、ゲームをbai始めましょduう！","link":"/2020/06/13/Principles-10-Rules/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/05/15/hello-world/"},{"title":"关于hexo搭建网站的一些心得汇总（持续更新）","text":"首先祝贺网站搭建成功！！！✿✿ヽ(°▽°)ノ✿撒花！然后为了记录这一艰辛的历程（其实也算不上太艰辛，就是查资料为主），特此记录下本人在搭建过程中的心得体会与经验，供日后参考之用，也为后来想搭建博客的朋友节省一些时间。 搭建hexo+github的博客，首先是参考资料：主要要用到的就这两个：https://www.jianshu.com/p/ef3f221a0374https://www.jianshu.com/p/09875c4a629c安装nodejs、gitbash、连接公钥到github的步骤参照第一个网址。安装hexo那里就参照第二个网址。然后hexo安装完成后的步骤也参照第一个网址。当部署完成之后，需要常用的一些hexo命令：hexo clean（当部署没成功时经常用到的一个命令）\\hexo generate(hexo g)\\hexo deploy(hexo d)\\hexo server…etc过多的我就不再赘述。 然后是修改主题，分为下载主题、部署主题两个部分。关于下载主题，用现在常用的方法git clone是很慢的还容易失败，鉴于现在主题在github上都能找到文件，因此常用的方法是在相应的仓库中下载压缩包解压后在你的blog文件里themes主题下创建同名文件夹再复制过去即可。当然，这种方法会显示一些确实的dependencies文件，用hexo config themename修改主题名字后运行hexo server会提醒你有哪些dependency没有安装，此时你只需要按照git bash上提示你的npm命令去操作就可以下载完了。关于部署主题，有一点需要注意：如果你的网站在预览时显示的是修改后的主题但是进入你的网站后还是修改前的主题，具体参照：https://www.zhihu.com/question/29808864 最后如果你不满足自己的域名，可以前往阿里云购买域名，实名认证后解析dns并修改，具体参照：https://www.jianshu.com/p/e3169b681038这样就可以更换你的域名了。 ————————————————————————分割线2020.5.22更新—————————————————————————————","link":"/2020/05/22/%E5%85%B3%E4%BA%8Ehexo%E6%90%AD%E5%BB%BA%E7%BD%91%E7%AB%99%E7%9A%84%E4%B8%80%E4%BA%9B%E5%BF%83%E5%BE%97%E6%B1%87%E6%80%BB%EF%BC%88%E6%8C%81%E7%BB%AD%E6%9B%B4%E6%96%B0%EF%BC%89/"},{"title":"对学习能力的一点认知","text":"之前偶然读到一篇很好的文章：https://www.zhihu.com/question/35103080/answer/457627276 其中我摘录了部分：&lt;1&gt; 对很多内容大胆的说“不” —– 这不是放弃，是策略！！ 举个例子，我本人大学的时候就犯过一个错误。当时我学什么都希望可以彻底的弄懂，比如学电子电路，我就希望可以把来龙去脉全部掌握，可是越挖越深，越来越无力。碰到啃不动的内容伤害了自己脆弱的自信心，也浪费了很多时间。后来工作几年后，偶然的机会我要做一个互动装置，里面需要有一些电路控制机械和灯的变化效果。后来工作几年后，偶然的机会我要做一个互动装置，里面需要有一些电路控制机械和灯的变化效果。在这之后，才进一步学了比较系统的电路设计知识。在这之后，才进一步学了比较系统的电路设计知识。大多数情况下，“知道这是什么，可以用来干嘛，什么时候会用到它”已经足够了。现在是知识外包的时代，很多知识都直接在网上搜索，还有一些知识可以问别人。存在互联网上，和存在别人脑子里的知识，也是你的知识，只要你有迅速准确获取它们的能力。对我来说，花费大量的时间去”钻研电子电路知识”，是非常没有投资回报率的做法。学什么，不学什么。精通什么，略懂什么，这是一个你根据对自己“知识版图”的规划，和学习这些知识的“回报率”来分配自己时间，最大化“收益”的策略性问题。很多人会有学生思维，觉得非要跟自己学不懂的东西杠上了，花了九牛二虎之力弄懂了一些问同学、问前辈一秒钟就能得到答案的问题，还获得了“战胜自己”的成就感。其实这是浪费自己的时间！！！ ——————-具体怎么决定“学什么，不学什么。精通什么，略懂什么”呢？—————- 在纸上画出你希望自己达到的“知识之树”，也就是你希望自己达到的“知识版图”。主干部分就是你需要精通的，树枝部分是你需要熟悉的，小树枝是你可以略懂的，而具体的叶子则是你可以完全去网上搜索的。对于绝大部分人来说，把时间花在拓宽主干上，是回报率更高的做法，而不是花在添加叶子上。因为叶子多一片，少一片，并不会影响你的格局。主干拓宽已经够你跨界做出新东西了。添加叶子，也就是“弄懂弄透一些小知识”，可以放到做具体项目的时候按需要临时去学习。 &lt;2&gt; “项目导向”的学习——不是“把学的东西用起来”，而是”为了用而学”！ 根据Situated Learning Theory(情境学习理论），在限定时间内解决一个“既有挑战又能带给你成就感的”具体问题的过程中, “顺便”去学习某个知识，效果是最好的。这时候，学习有了明确的目的。学这块知识，就是为了解决这个问题。例如，如果你想学英语，要搞清楚，为什么要学？不是因为别人学了所以我也要学，而是因为，我想马上做成的某件事，需要“用英语”才能做。比如我想在两个月内翻译完某部美剧的第一季，就自然要去查某些词了。我想在半年内跟老外做成一笔生意，那就不得不学习商务英语了。又比如今晚想去跟老外约会，就得学习谈恋爱的英语了。为了解决不同问题，需要不同的学习内容和目标。永远不要把学习本身作为目标，学习只是你为了达到想做的某件事，而顺便做的。更高阶的一些同学，因为立志解决某些问题，而产生了强大的驱动力，主动去学习各种知识。比如我有个朋友立志解决非洲饮用水的过滤问题，他从陶器的多孔性里看到用陶器来过滤水的可能，于是就研究起了这个。为了克服饮用水里的细菌问题，他有充足的动力去学习微生物学的知识。 &lt;5&gt; Working Memory 理论：拆分小片段，多次回忆，多次复述。学的过程中就回忆！！ 一般我们上课时，大多都会跟着老师上45分钟，然后课后才会复习一下。但是我们大脑的working memory其实记不了那么多。所以到课后去复习的时候，基本刚才上的内容都忘得差不多了。等于又要从头学一遍。所以，在上课的过程中，学习的过程中，就要“边学边总结”，“边学边复习”。比如，每5分钟，就总结一下，刚才那段，老师讲了些什么。上课的时候可以记录一个思维地图，以5分钟为一个节点。这样到下课的时候，只要把这些节点再串一遍就好。要点就是，不要等到学的量超过了你的Working Memory容量再去回忆。要每隔一小会儿就总结一下，记在纸上，让大脑可以迎接新的任务。不要等到桶都满了，水都漫出来了，才想到去换一个空桶接水。 下面讲讲我的体会：作者对于第二点的说明无疑是颠覆我们从小到大的学习方式的。想一想，从小时候开始，父母教导的总是“学以致用”，就是先学习，然后再去应用，我们一直接受的教育方式也是老师讲完-&gt;课下做题这样的方式。貌似一定要先系统地学习后才能得到应用的可能。但是有没有这样一种可能呢？当我们全身心投入到一个项目，以完成项目为导向。或者以解决某个问题为目的的问题导向学习时，这样的学习效率会不会更高呢？作者以自己的亲身经历作证了这一点。同时，这个暑假我也实践过很多次，从切身经历来看，这个带给我的感悟是最深的。能力的积累其实不来自于学习，而是来自于应用，为了应用去解决问题、完成项目本身就是一个极佳的学习方式。在这个过程中，你会碰到各种各样的问题，你也会通过不断地解决这些问题收获成长与进步。我学剪辑的初衷也只是为了做出完美的视频分享出去，在这个过程中我渐渐掌握了剪辑的要领。 但有两点需要注意：第一、为了项目去学习不代表否定了系统性学习。系统性学习是必要的。在完成任何一个项目当中，都是在解决问题和系统学习两种方法之间不断切换，如果我连这个项目中涉及的一些基本概念都不清楚那我根本不可能去完成它。所以两者应该是相辅相成的，任何单一地信赖某种方法都会导致学习效率低下。第二、项目的设置不应该超出自身能力范围太多，而是努力一下能够够到的程度，这一点不需要多解释。让一个才学完乘法表的人去完成关于数学建模的项目其难度不亚于让母猪爬树。 总而言之，能力的积累主要来源于解决问题和完成项目。","link":"/2020/05/24/%E5%AF%B9%E5%AD%A6%E4%B9%A0%E8%83%BD%E5%8A%9B%E7%9A%84%E4%B8%80%E7%82%B9%E8%AE%A4%E7%9F%A5/"}],"tags":[{"name":"-Diary","slug":"Diary","link":"/tags/Diary/"},{"name":"-Plan","slug":"Plan","link":"/tags/Plan/"},{"name":"-Questions","slug":"Questions","link":"/tags/Questions/"},{"name":"-Principles","slug":"Principles","link":"/tags/Principles/"},{"name":"-学习能力","slug":"学习能力","link":"/tags/%E5%AD%A6%E4%B9%A0%E8%83%BD%E5%8A%9B/"}],"categories":[]}